Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 399, 12)]         0         
_________________________________________________________________
lstm (LSTM)                  (None, 64)                19712     
_________________________________________________________________
dropout (Dropout)            (None, 64)                0         
_________________________________________________________________
dense (Dense)                (None, 2)                 130       
=================================================================
Total params: 19,842
Trainable params: 19,842
Non-trainable params: 0
_________________________________________________________________
